[
    {
        "title": "Graduation Project",
        "description": "This project investigates the use of deep learning technology, especially CNNs in the medical field to classify magnetic resonance images (MRI). So, we created a mobile application with many features and linked it to the deep learning model that we had previously trained via an API to help doctors and patients identify whether patients have brain cancer or not. Users in the System → (Admin, Patients, and Doctor).",
        "video": "https://www.youtube.com/embed/1HwVtHCv7B0"
    },
    {
        "title": "Banking System Web Application | ASP.NET MVC (ITI)",
        "description": "This project is a robust and secure web-based banking platform designed to simplify the management of banking operations for users and administrators. With its intuitive interface and powerful backend, it provides essential banking functionalities ranging from account management to transaction processing.",
        "video": "https://www.youtube.com/embed/PV9CdZ34tAk"
    },
    {
        "title": "E-Commerce Web Application | Angular (ITI)",
        "description": "AnguShop is a modern E-Commerce web application built with Angular. It showcases a scalable, maintainable architecture suited for real-world online stores. It uses a mock API for development, enabling a seamless shopping experience with advanced features like role-based access, smart filtering, secure checkout, and admin analytics.",
        "video": "https://www.youtube.com/embed/enIbwn42kRc"
    },
    {
        "title": "Hotel Management System (ITI)",
        "description": "This project showcases how to manage hotel reservations, room services, and customer data efficiently using C#, .NET, MSSQL Server, implementing Entity Framework, Dapper, Migrations, Benchmarking and Bogus Data.",
        "video": "https://www.youtube.com/embed/DpWFh8CNeRU"
    },
    {
        "title": "Examination System (ITI)",
        "description": "Examination System is designed to facilitate a seamless experience for three distinct user roles → Admin: Manages the overall system, users, and settings & Instructor: Creates and manages exams, evaluates student performance & Student: Takes exams and tracks their progress. Using C#, WinForms, MSSQL Server, ADO.NET, MVC, Report Builder, and iTextSharp package.",
        "video": "https://www.youtube.com/embed/ZUr_lzxwLco"
    },
    {
        "title": "Simple Search Engine - Information Retrieval Project",
        "description": "Very simple search engine by using positional index, phrase query and vector space model concepts on a small dataset.",
        "video": "https://www.youtube.com/embed/uSczSTmjNEs"
    },
    {
        "title": "Brain Cancer Multi Classification - Deep Learning Project",
        "description": "This project presents an approach for brain tumor classification MRI using CNNs and demonstrates its superior performance in image classification.",
        "video": "https://www.youtube.com/embed/B4n_O51cDB0"
    },
    {
        "title": "Project Management System - Java Project",
        "description": "This desktop application is used to manage projects and tasks and it consists of 4 modules: (admin, project-manager, team-leader and employee).",
        "video": "https://www.youtube.com/embed/s333rvKEnOs"
    },
    {
        "title": "Text Classification for Multi Cancer - NLP Project",
        "description": "NLP project for multi-cancer text classification by using LSTM on a dataset containing colon, lung, and thyroid cancer.",
        "video": "https://www.youtube.com/embed/G8wwJ3u0bY8"
    },
    {
        "title": "MNIST Digits Classification - Pattern Recognition Project",
        "description": "Handwritten digits recognition is a classic problem in the field of image classification. The MNIST dataset, consisting of 60,000 training and 10,000 testing grayscale images of handwritten digits.",
        "video": "https://www.youtube.com/embed/JYuBZA52BmQ"
    },
    {
        "title": "Alert Program for Laptop Battery Charger",
        "description": "Short Video: Monitors laptop battery status and alerts when status changes.",
        "video": "https://www.youtube.com/embed/HvdsDFNALlg"
    },
    {
        "title": "My Portfolio",
        "description": "Simple Portfolio by using HTML, CSS, and JavaScript.",
        "video": "https://www.youtube.com/embed/hQKByHd4Pt4"
    }
]